
// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------

"Clover_title" = "Clover EFI";
"Clover_description" = "简而言之，Clover EFI 幸运草 需要三个必要的文件。
boot0 (在硬盘的 MBR) 负责载入 boot1。
boot1 (在分区的开机磁区 boot-sector) 搜寻 boot2。
boot2 (在分区的根目录) 载入 /EFI/BOOT/CLOVERIA32.efi 或 CLOVERX64.efi 及系统核心等等。";

"boot0_title" = "1. BIOS 安装 boot0 (HFS+Fat32)";
"boot0_description" = "使用 fdisk440 将 boot0 写入 MBR 的前 440 位元，避免损坏已经存在的 Windows 机码，boot0 会在第一个 HFS 激活 分区开始搜寻 boot1h2，或在第一个 Fat32 激活 分区搜寻 boot1f32alt。
本安装将 会 设置 HFS 及 Fat32 安装分区为激活分区。
必须在 Win 先将分区格式化为 Fat32 格式分区，或在 Mac 操作如下
  1. 先用 磁碟工具 抹掉 为 MS-DOS (FAT) 格式
  2. diskutil list
  3. diskutil unmount /dev/rdisk9s1
  4. newfs_msdos -v Fat32 -F 32 /dev/rdisk9s1
  5. diskutil mount /dev/rdisk9s1";

"boot0hfs_title" = "1. BIOS 安装 boot0hfs (HFS+Fat32)";
"boot0hfs_description" = "使用 fdisk440 将 boot0hfs 写入 MBR 的前 440 位元，避免损坏已经存在的 Windows 机码，boot0hfs 会在第一个 HFS 分区开始搜寻 boot1h2，或在第一个 Fat32 激活 分区搜寻 boot1f32alt。
本安装将 不会 设置 HFS 安装分区为激活分区，
本安装将 会 设置 Fat32 安装分区为激活分区。
必须在 Win 先将分区格式化为 Fat32 格式分区，或在 Mac 操作如下
  1. 先用 磁碟工具 抹掉 为 MS-DOS (FAT) 格式
  2. diskutil list
  3. diskutil unmount /dev/rdisk9s1
  4. newfs_msdos -v Fat32 -F 32 /dev/rdisk9s1
  5. diskutil mount /dev/rdisk9s1";

"boot0EFI_title" = "1. BIOS 安装 GPT EFI (HFS+Fat32)";
"boot0EFI_description" = "使用 fdisk440 将 boot0hfs 写入 MBR 的前 440 位元，避免损坏已经存在的 Windows 机码， boot0hfs 会在 GPT EFI 分区搜寻 boot1h2 或 boot1f32alt。
本安装将 不会 设置 HFS 及 Fat32 安装分区为激活分区。
必须先将分区格式化为 HFS 格式分区，在 Mac 操作如下，
  diskutil list
  newfs_hfs -v EFI /dev/rdisk9s1
或是先将分区格式化为 Fat32 格式分区，在 Mac 操作如下，
  diskutil list
  newfs_msdos -v EFI -F 32 /dev/rdisk9s1";

"boot1no_title" = "1. BIOS 不安装 boot1 (4kb手动安装)";
"boot1no_description" = "不安装 boot0 , boot0hfs, boot0md, boot1h2 或 boot1f32alt，适用手动安装的 4kb 硬盘。";

"boot1UEFI_title" = "1. UEFI 安装 (UEFI 引导 Clover 开机)";
"boot1UEFI_description" = "适用安装 采用 UEFI 引导 Clover EFI 开机的 UEFI 主机版。
不安装 boot0 , boot0hfs, boot0md,  boot1h2 或 boot1f32alt。
本安装将 会 安装 UEFI 引导专用的驱动到 /EFI/drivers32 及 /EFI/drivers64。
需自行设置 UEFI 直接引导：
UEFI -> /EFI/BOOT/CloverX64.efi -> boot.efi -> OS X";

"boot32_title" = "2. 安装 boot 32位 优先启动";
"boot32_description" = "安装 32位+64位 boot 文件，并优先启用 32位系统。
默认启动 boot = Clover boot 32位，可在 test done 的 2 秒内，
按 1 选 boot1 = 变色龙 boot，
按 3 选 boot3 = Clover boot 32位，
按 6 选 boot6 = Clover boot 64位。";

"boot64_title" = "2. 安装 boot 64位 优先启动";
"boot64_description" = "安装 32位+64位 boot 文件，并优先启用 64位系统。
默认启动 boot = Clover boot 64位，可在 test done 的 2 秒内，
按 1 选 boot1 = 变色龙 boot，
按 3 选 boot3 = Clover boot 32位，
按 6 选 boot6 = Clover boot 64位。";

// ============================================================================
// Themes
// ----------------------------------------------------------------------------

"Themes_title" = "开机主题";
"Themes_description" = "选择安装，开机时，显示的背景主题。";

"black_green_title" = "黑绿主题";
"black_green_description" = "默认安装来自 Blackosx 的黑绿主题。
安装位置 /EFI/BOOT/themes/black_green。";

"buttons_title" = "按钮主题";
"buttons_description" = "选择安装来自 Trauma 的按钮主题。
安装位置 /EFI/BOOT/themes/buttons。";

"hellfire_title" = "地狱火主题";
"hellfire_description" = "选择安装来自 illevelll 的地狱火主题。
安装位置 /EFI/BOOT/themes/hellfire。";

"metal_title" = "金属主题";
"metal_description" = "原始默认安装来自 Slice 的金属主题，现已改由黑绿主题作为默认安装。
安装位置 /EFI/BOOT/themes/metal。";

"simple_gray_title" = "简灰主题";
"simple_gray_description" = "选择安装来自 hijeane 的简灰主题。
安装位置 /EFI/BOOT/themes/simple_gray.";

"wooden_title" = "原木主题";
"wooden_description" = "选择安装来自 iROOTa 的原木主题。
安装位置 /EFI/BOOT/themes/wooden.";

// ----------------------------------------------------------------------------